 /**
  ******************************************************************************
  * @file    cmd_tabl.h
  * @author  Trembach D.N.
  * @version V1.0.0
  * @date    07-10-2019
  * @brief   файл массива функций обработки команд терминала  
  ******************************************************************************
  * @attention
  *
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __CMD_TABL
#define __CMD_TABL

#include "stm32f10x.h"
#include "cmd_process.h"

/* Массив описания команд с указателями на обработчик */
extern cmd_t array_cmd[];
/* Число команд терминала                             */
extern const uint8_t max_num_cmd;

#endif /* __CMD_TABL */
/************************ (C) COPYRIGHT ONE TO ONE *****END OF FILE****/

