 /**
  ******************************************************************************
  * @file    cmd_tabl.c
  * @author  Trembach D.N.
  * @version V1.0.0
  * @date    07-10-2019
  * @brief   файл массива функций обработки команд терминала  
  ******************************************************************************
  * @attention
  *
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "cmd_tabl.h"
#include "cmd_hdl.h"
#include "cmd_hlp.h"

/*============================================================================*/
/*===========  Массив описания команд с указателями на обработчик ============*/
/*============================================================================*/
cmd_t array_cmd[] =
{
  /*================= команда помощи =============================*/
  { 
  /* имя ( мнемомика ) команды        */  
  "help",
  /* тип параметра команды            */
  STRING,
  /* краткое описание команды         */
  "команда предназначена для вывода в терминал справки",
  /* расширенное описание команды     */
  "команда предназначена для вывода на экран справочной информации \r\n  по командам терминала.\r\n  формат команды: >help <STRING> \r\n   all - вывод краткой справки по всем командам, \r\n   <STRING> - вывод на экран полной информации о команде, \r\n   мненомика которой указана в поле STRING.",
  /* указатель на обработчик команд   */    
  help_cmd_handler
  },
  /*================= команда сброса =============================*/  
  {
  /* имя ( мнемомика ) команды        */   
  "reset",
  /* тип параметра команды            */
  NONE,
  /* краткое описание команды         */
  "команда перезапуска контроллера",
  /* расширенное описание команды     */ 
  "команда предназначена для програмного перезапуска микроконтроллера.\r\n  формат команды: >reset <NONE> \r\n",
  /* указатель на обработчик команд   */    		
  reset_cmd_handler
  },
  /*================= команда сброса =============================*/  
  {
  /* имя ( мнемомика ) команды        */   
  "led",
  /* тип параметра команды            */
  STRING,
  /* краткое описание команды         */
  "команда управления светодиодом",
  /* расширенное описание команды     */ 
  "команда предназначена для установки режима работы светодиода.\r\n  формат команды: >led <STRING> \r\n   on - светодиод включен, \r\n   off - светодиод выключен.",
  /* указатель на обработчик команд   */    		
  led_cmd_handler
  }  
};

/* число команд терминала */
const uint8_t max_num_cmd = (sizeof(array_cmd)/sizeof(cmd_t));

/************************ (C) COPYRIGHT ONE TO ONE *****END OF FILE****/